# +号运算符 提供的是拼接操作（要求：字符串只能和字符串拼接）
print("hello"+" world")

# *号运算符  乘以一个正整数n 将字符串的内容重复n次
print("yhedu "*3)
# %号运算符 格式化在字符串未知的位置使用占位符占位，再对字符串使用%运算符给占位符赋值
#  %s字符串 %d整数	%f小数
print("姓名:%s,年龄%d,薪水%.2f"%("张三",18,1234.56))
print("-------------------------")
# +=号运算符 在变量原来值的基础上拼接上新的内容（要求：字符串只能和字符串拼接）
str1 = "hello"
str1 += " world"
print(str1)
print("-------------------------")
# *=号运算符 在变量值的基础上将内容重复n次 赋值给变量
str2 = "yhedu "
str2 *= 3
print(str2)
print("-------------------------")
print("-------------------------")
# 关系运算符 > >=	< <= ==	!=
# 字符在比较的时候按照什么来比较的？？？  python是utf-8的编码  所以它是按照utf-8编码规则 对比字符对应的十进制数据
str3_1 = "a"
str3_2 = "A"
print(str3_1 > str3_2)
print("-------------------------")
print("-------------------------")
print("-------------------------")
# 成员运算符
str4_1 = "a"
str4_2 = "abc"
print(f"a是否存在abc中？{str4_1 in str4_2}")
print(f"a是否不存在abc中？{str4_1 not in str4_2}")
print("-------------------------")
print("-------------------------")
#身份运算符
str5_1 = "abc"
str5_2 = "abc"
print(f"str5_1中存储的字符串内存地址是：{id(str5_1)}")
print(f"str5_2中存储的字符串内存地址是：{id(str5_2)}")
print(f"str5_1和str5_2的地址是否相等？：{str5_1 is str5_2}")
print(f"str5_1和str5_2的地址是否不相等？：{not str5_1 is str5_2}")