# 1、使用java代码编写万年历
# 2.  【最难】设计一个函数，可以接收若干的数字，计算他们的次大值
#
# 3.  假设你正在开发一个简单的数值计算器，该程序可以实现以下功能：
#   ○ 加法。程序可以让用户输入两个数，并计算它们的和。
#   ○ 减法。程序可以让用户输入两个数，并计算它们的差。
#   ○ 乘法。程序可以让用户输入两个数，并计算它们的积。
#   ○ 除法。程序可以让用户输入两个数，并计算它们的商。
#   ○ 幂运算。程序可以让用户输入一个底数和一个指数，并计算它们的幂。
# 欢迎使用计算器
# ****************************************
# 请输入需要计算的数字: 9
# 请输入需要进行的计算: +
# 请输入需要计算的数字: 12
#
# 9 + 12 = 21
#
# ****************************************
# 请输入需要计算的数字: 9
# 请输入需要进行的计算: **
# 请输入需要计算的数字: 2
#
# 9 ** 2 = 81
#
# 4.  设计一个猜数字游戏，程序会随机生成一个 1~100 之间的整数，然后让用户猜这个数字是多少。
#     大家一起来猜数！
# ****************************************
# 系统生成随机数中...
# [1, 100] 的随机数已生成！
#
# 猜猜看，这个数字是多少: 89
# 猜大了，再试试，新的范围是 [1, 88]: 20
# 猜小了，再试试，新的范围是 [21, 88]: 56
# 猜对了！恭喜你用了 3 次机会，猜到了答案！