# 循环打印5次Hello World!
i = 5
while i > 0:
    print("第%d次打印"%(5-i+1), end="")
    print("hello world!")
    i = i - 1
#################################################
# 计算1~100的累积和（包含1和100） 5050
num = 1 #控制次数的
sum = 0 #累加 0 1 3 6.....  5050
while num <= 100:
    sum += num
    num += 1
print("累加的结果为"+str(sum))

###########################

# 计算1~100之间偶数的累积和（包含1和100）
num = 1 #控制次数的
sum = 0 #累加 0 1 3 6.....  5050
while num <= 100:
    # 判断数字是否为偶数，如果为偶数，就累加，不是偶数放弃
    if num % 2 == 0:
        sum += num
    num += 1
print("累加的结果为"+str(sum))
#################################################
"""
 *
 * *
 * * *
 * * * *
 * * * * *
"""
# 储备的知识：print 默认是打印一行换行 ，要想不换行 需要指定 end
print("* ")
# 指定打印*结束后，空格作为结束
print("*",end=" ")
# 打印* ,结束符啥也不指定，默认是\n
print("* ",end="")
# 此处的作用是换行
print()
# 这句话的意思是 a 重复打印5次
print("a" * 5)
# 以下开始编写代码
print("===================================")
# num 表示 第几次循环
num = 1
# 表示循环5次结束
while num <= 5:
    # count 表示 行数，*的数量刚好跟行数的数量是一样的
    count = num
    # 该循环表示打印* 的次数
    while count > 0:
        print("*",end=" ")
        count = count -1
    # 每行打印完之后要换行，要不然变一行
    print()
    # 每次大循环结束，num要+1 , 因为要跳出循环
    num = num + 1