
#-------------------------
# 比较运算符
'''
==	判断内容是否相等，满足为True，不满足为False	如a=3,b=3，则(a == b) 为 True
!=	判断内容是否不相等，满足为True，不满足为False	如a=1,b=3，则(a != b) 为 True
>	判断运算符左侧内容是否大于右侧 满足为True，不满足为False	如a=7,b=3，则(a > b) 为 True
<	判断运算符左侧内容是否小于右侧满足为True，不满足为False	如a=3,b=7，则(a < b) 为 True
>=	判断运算符左侧内容是否大于等于右侧满足为True，不满足为False	如a=3,b=3，则(a >= b) 为 True
<=	判断运算符左侧内容是否小于等于右侧满足为True，不满足为False	如a=3,b=3，则(a <= b) 为 True
'''
# 比较表运算符  --》 比较运算符最终计算出的结果是bool类型

#数字比较
a1 = 10
b1 = 10
print(a1 == b1)

a2 = 3.14
b2 = 3.15
print(a2 >= b2)

"""需要注意:在python中没字符的概念存在，所以无论使用单或双引号括起来的都是字符串，使用比较运算符计算时比较的是文本内容，即对应ASCII和Unicode值"""
a3 = 'a'
b3 = 'a'
print(a3.__eq__(b3))

a3_1 = 'A'
b3_1 = 'a'
print(a3_1 > b3_1)

a3_2 = '我'
b3_2 = '我'
print(a3_2 >= b3_2)

# python允许在进行范围比较的时候，使用连续比较的方式
score = 90
print(60 <= score <= 100)

# ==运算符会比较字符串，而不会查看字符串的内存位置。__eq__方法是在类中定义的，用于比较两个对象。
