print(2 + 3)
print(2 - 3)
print(2 * 3)
print(3 / 2)  # 1.5 python语言是取到小数的
print(7 % 2) # 取余数 1  还有一个叫法取模
print(7 // 2) # 3  取结果的整数部分
print(7 / 2) # 3.5
print(2 ** 3) # 2的3次方 幂

#-------------------------
#练习 请输入一个年份，并告知该年份是否为闰年？
"""

第一步：  input 获取一个年份
第二步：  将该年份变为数字  字符串变数字
第三步：  判断条件是否满足闰年的条件
"""
print("请输入年份：")
year = input()
print(type(year))
# 将str变为int
year = int(year)
# 能够对4整除不能被100整除，或者能被400整除 是闰年
if year%4==0 and year%100!=0 or year%400==0:
    print(f"{year}是闰年")
else:
    print(f"{year}不是闰年")

#-------------------------
#练习 赋值运算符
# * / 优先级高于 + /
num = 1 + 2 * 3
# () 优先级高
num2 = (1 + 2) * 3
print(num)
print(num2)
# 同时为多个变量赋值
a,b = 10,20
print(a)
#-------------------------
'''
+=    加法赋值运算符    c+=a等效于c=c+a
-=    减法赋值运算符    c-=a等效于c=c-a
*=    乘法赋值运算符    c*=a等效于c=c*a
/=    除法赋值运算符    c/=a等效于c=c/a
%=    取模赋值运算符    c%=a等效于 c=c%a
**=    幂赋值运算符    c**=a等效于 c=c**a
//=    取整除赋值运算符    c//=a等效于c=c//a
'''
a += b # 等同于 a = a + b
print(a)
a //= b  # a=30 b =20
print(a) # a = 1
